var __map = null;

// 新宿御苑の範囲を表す緯度経度
var coordinates = [
    [[139.71005104383386, 35.68179658276378],
    [139.70794819196615, 35.68287719820597],
    [139.70575950941003, 35.683992656859445],
    [139.70502994855795, 35.68472466812544],
    [139.70434330305017, 35.68608409980037],
    [139.70485828718103, 35.687548077236144],
    [139.70584534009848, 35.68824519990561],
    [139.70726154645834, 35.688384623708416],
    [139.70837734540856, 35.68824519990561],
    [139.7091927369491, 35.68747836463413],
    [139.71082352003012, 35.68719951361685],
    [139.71189640363608, 35.68712980071024],
    [139.71331260999597, 35.68702523123605],
    [139.71357010206137, 35.68643266829335],
    [139.71408508619226, 35.68573552978438],
    [139.71455715497885, 35.68500352779341],
    [139.71455715497885, 35.68423666136103],
    [139.7144713242904, 35.68427151908605],
    [139.7150292237655, 35.68353950366236],
    [139.7154154618636, 35.683016631390515],
    [139.71464298566735, 35.68197087656698],
    [139.7137846787826, 35.68158742969743],
    [139.71241138776693, 35.68137827608278],
    [139.71005104383386, 35.68179658276378]
    ]]


function loadMap() {

    // マップの作成
    __map = new ol.Map({
        target: 'map',
        layers: [
            new ol.layer.Tile({
                source: new ol.source.OSM()
            })
        ],
        view: new ol.View({
            center: ol.proj.fromLonLat([139.70975414280838, 35.684790287260014]),
            zoom: 15
        })
    });

    drawPolygon();
}

/**
 * ポリゴンを描画する
 */
function drawPolygon() {
    // ジオメトリの作成
    var polygon = new ol.geom.Polygon([]);
    polygon.setCoordinates(coordinates);

    // 地物オブジェクトの作成　〜　レイヤーの作成
    var feature = new ol.Feature(
        polygon.transform('EPSG:4326', 'EPSG:3857')
    );
    feature.setId('tokyotower');

    var vector = new ol.source.Vector({
        features: [feature]
    });
    var routeLayer = new ol.layer.Vector({
        source: vector,
        style: new ol.style.Style({
            stroke: new ol.style.Stroke({ color: '#000000', width: 5 }),
            fill: new ol.style.Fill({ color: [0, 0, 0, 0.5] })
        })
    });

    // 作成したポリゴンをレイヤーにのせる
    __map.addLayer(routeLayer);
}


